<template lang="pug">
div.all
  div.image
    img(width="15%" height="auto" :src="require(`@/assets/${img}`)")
  div.text
    span Добро пожаловать в наш магазин, где мы предлагаем процессоры от ведущих производителей! Процессоры – это сердце вашего компьютера, обеспечивающие высокую производительность и плавное функционирование системы.

    span У нас в ассортименте вы найдете процессоры от таких производителей, как Intel и AMD, которые предлагают передовые технологии и инновации. Независимо от того, нужен ли вам процессор для повседневного использования, мультимедийных задач или игр, у нас есть подходящий вариант.

    span Наши процессоры отличаются высокой тактовой частотой, многопоточностью и большим объемом кэш-памяти, что обеспечивает быструю обработку данных и отзывчивость системы. Будьте уверены, что приобретая процессор в нашем магазине, вы получаете надежный и производительный продукт.

    span Наши специалисты всегда готовы помочь вам с выбором и ответить на все вопросы. Покупайте процессоры от производителей с мировым признанием у нас – и ваш компьютер станет еще более эффективным и мощным!  

</template>

<script>
export default {
  props: ['img']

}
</script>

<style scoped>
  
</style>